<p align="center" >
<a href="https://www.wdc.ng/">
<img src='https://images.yalwa.com.ng/Wild-Fusion-Digital-Centre/vap_1019131596.png'>
</a>
</p>

### Pandas Series Exercise

In [6]:
import pandas as pd

In [3]:
labels = ['a','b','c','d','e']
data = [10, 20, 30, 40, 50]
data_dict = {'A': 10, 'B': 20, 'C': 30, 'D': 40, 'E': 50}

In [23]:
Ser=pd.Series(data,labels)
print(Ser)

Ser2=pd.Series(data_dict)
print(Ser2)

print(Ser2['C'])
print(Ser2['D'])

a    10
b    20
c    30
d    40
e    50
dtype: int64
A    10
B    20
C    30
D    40
E    50
dtype: int64
30
40

### Pandas DataFrame Exercise

In [57]:
data2 = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}
df=pd.DataFrame(data2)
(df)

(df['City'])

df['last_name']= ['john','greg','bucknor']
df['Sex']=['F','M','M']

no_age= df.drop('Age',axis=1)

name_index= no_age.set_index('last_name')
greg=name_index.loc['greg']

greg

Name              Bob
City    San Francisco
Sex                 M
Name: greg, dtype: object

In [55]:
# comparing
df
df['Name']=='Bob'
df[df['Name']=='Bob']

  Name  Age           City last_name
1  Bob   30  San Francisco      greg

In [58]:
df

      Name  Age           City last_name Sex
0    Alice   25       New York      john   F
1      Bob   30  San Francisco      greg   M
2  Charlie   35    Los Angeles   bucknor   M

In [60]:
df[(df['Sex']=='M')& (df['Age']>23)]

      Name  Age           City last_name Sex
1      Bob   30  San Francisco      greg   M
2  Charlie   35    Los Angeles   bucknor   M

In [61]:
#where sex is male of female
df[(df['Sex']=='M')|(df['Sex']=='F')]

      Name  Age           City last_name Sex
0    Alice   25       New York      john   F
1      Bob   30  San Francisco      greg   M
2  Charlie   35    Los Angeles   bucknor   M

In [62]:
#where sex is not male
df[~(df['Sex']=='M')]

    Name  Age      City last_name Sex
0  Alice   25  New York      john   F

### Pandas Groupby Exercise

In [79]:
data3 = {'Region': ['North', 'North', 'South', 'South', 'East'],
        'Category': ['Electronics', 'Furniture', 'Electronics', 'Furniture', 'Electronics'],
        'Sales': [1000, 800, 1200, 900, 1500],
        'Profit': [200, 100, 250, 120, 300]}
data3_df = pd.DataFrame(data3)
data3_df

data3_df.groupby('Category')[['Profit','Sales']].sum()
data3_df

  Region     Category  Sales  Profit
0  North  Electronics   1000     200
1  North    Furniture    800     100
2  South  Electronics   1200     250
3  South    Furniture    900     120
4   East  Electronics   1500     300

In [68]:
data3_df.groupby('Region')[['Profit','Sales']].sum()

        Profit  Sales
Region
East       300   1500
North      300   1800
South      370   2100

In [72]:
data3_df.groupby(['Category','Region'])[['Profit','Sales']].sum()

                    Profit  Sales
Category    Region
Electronics East       300   1500
            North      200   1000
            South      250   1200
Furniture   North      100    800
            South      120    900

In [80]:
data3_df['Category'].unique()

array(['Electronics', 'Furniture'], dtype=object)

In [81]:
data3_df['Category'].nunique()

2

In [82]:
#to sort value in columns descending
data3_df['Region'].sort_values()

4     East
0    North
1    North
2    South
3    South
Name: Region, dtype: object

In [83]:
#to sort values in columns 
data3_df['Sales'].sort_values(ascending=False)

4    1500
2    1200
0    1000
3     900
1     800
Name: Sales, dtype: int64

In [84]:
#to sort values in data frames 
data3_df.sort_values('Sales',ascending=False)

  Region     Category  Sales  Profit
4   East  Electronics   1500     300
2  South  Electronics   1200     250
0  North  Electronics   1000     200
3  South    Furniture    900     120
1  North    Furniture    800     100

In [85]:
#for value counts in columns
data3_df['Region'].value_counts()

North    2
South    2
East     1
Name: Region, dtype: int64

In [87]:
def get_first_5(each_row):
    return each_row[0:5]

In [88]:
data3_df['Category'].apply(get_first_5)

0    Elect
1    Furni
2    Elect
3    Furni
4    Elect
Name: Category, dtype: object

In [95]:
def greet_student(name):
    print(f'Welcome {name}!')
    print(f'hows church today?')
    print(f'do have a nice day.')

In [96]:
greet_student('Lawrence')

Welcome Lawrence!
hows church today?
do have a nice day.

### Joins

In [74]:
data4 = {'ID': [1, 2, 3],
         'Name': ['Alice', 'Bob', 'Charlie']}
data5 = {'ID': [2, 3, 4],
         'Age': [25, 30, 35]}

df1 = pd.DataFrame(data4)
df2 = pd.DataFrame(data5)
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

In [75]:
df2

   ID  Age
0   2   25
1   3   30
2   4   35

In [76]:
pd.concat([df1,df2],axis=1)

   ID     Name  ID  Age
0   1    Alice   2   25
1   2      Bob   3   30
2   3  Charlie   4   35

In [77]:
pd.merge(df1,df2,on='ID',how='inner')

   ID     Name  Age
0   2      Bob   25
1   3  Charlie   30

### Pivot Table Exercise

In [87]:
data6 = {'Category': ['A', 'B', 'A', 'B', 'A'],
        'Region': ['North', 'North', 'South', 'South', 'East'],
        'Sales': [100, 200, 150, 250, 120]}